{
  "roles": [
    {
      "id": "1",
      "role": "Admin"
    },
    {
      "id": "2",
      "role": "Editor"
    },
    {
      "id": "3",
      "role": "Member"
    }
  ],
  "accounts": [
    {
      "id": "1",
      "roleId": "1",
      "username": "admin",
      "password": "admin",
      "name": "Quản trị viên",
      "isActived": true
    },
    {
      "id": "2",
      "roleId": "2",
      "username": "editor",
      "password": "editor",
      "name": "Team Dịch Truyện",
      "isActived": true
    },
    {
      "id": "3",
      "roleId": "3",
      "username": "member",
      "password": "member",
      "name": "User 1",
      "isActived": true
    }
  ],
  "novels": [
    {
      "id": "1",
      "name": "Toàn Trí Độc Giả",
      "author": "Manhwa TV",
      "image": "https://truyenchu.vn/uploads/Images/toan-tri-doc-gia.jpg",
      "introduction": "<p>Chỉ mình tôi mới biết kết cục của thế giới này.</p> <p> Một ngày nọ, nhân vật chính của chúng ta bị kẹt trong thế giới của bộ tiểu thuyết mình ưa thích. Anh phải làm gì để sống sót? Trong một thế giới tràn ngập những tai họa và nguy hiểm. Ưu thế ư? Anh nắm rõ kịch bản của toàn bộ câu truyện, ngay từ đầu đến cuối. Vì anh là độc giả duy nhất vẫn còn gắn bó với nó. </p> <p> Hãy đọc câu truyện của anh ấy để hiểu được cách mà anh ta sống sót trong thế giới này.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "Mở đầu - Ba Cách để Sống sót trong một Thế giới Đổ nát.",
          "content": "<p>[Có ba cách để sống sót trong một cái thế giới đổ nát </p>. <p> Hiện tại, tôi đã quên một vài cái, nhưng có một điều tôi có thể chắc chắn rằng, Bạn - người đang đọc những dòng này sẽ sống sót. </p> <p>- Ba cách để sống sót trong một thế giới đổ nát] Một trang web tiểu thuyết hiện lên trên màn hình điện thoại cũ nát của tôi. Tôi kéo lên rồi lại kéo xuống. Tôi làm chuyện này đã bao nhiêu lần rồi nhỉ? </p> <p>\" Thật sự? Đã kết thúc? \"</p> ",
          "uploadedDate": ""
        },
        {
          "id": "2",
          "title": "Mở đầu - Ba Cách để Sống sót trong một Thế giới Đổ nát.",
          "content": "",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "2",
      "name": "Harry Potter và Hòn đá Phù thủy (Quyển 1)",
      "author": "J. K. Rowling",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQtFKRzqIPBTYkse7NKIPTjw0ggQB02c636StmC1mONyQwec4x1",
      "introduction": "<p>Harry Potter, một đứa trẻ mồ côi mười một tuổi, phát hiện ra mình là một phù thủy và được mời đến học tại trường Hogwarts.</p> <p>Ngay cả khi cậu thoát khỏi cuộc sống buồn tẻ và bước vào thế giới phép thuật, cậu vẫn thấy rắc rối đang chờ đợi mình.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "ĐỨA BÉ VẪN SỐNG",
          "content": "<p>Ông bà Dursley, nhà số 4 đường Privet Drive, tự hào mà nói họ hoàn toàn bình thường, cám ơn bà con quan tâm. Bà con đừng trông mong gì họ tin vào những chuyện kỳ lạ hay bí ẩn, đơn giản là vì họ chẳng hơi đâu bận tâm đến mấy trò vớ vẩn đó.</p> <p> Ông Dursley là giám đốc một công ty gọi là Grunnings, chuyên sản suất máy khoan. Ông là một người cao lớn lực lưỡng, cổ gần như không có, nhưng lại có một bộ ria mép vĩ đại.</p> <p> Bà Dursley thì ốm nhom, tóc vàng, với một cái cổ dài gấp đôi bình thường, rất tiện cho bà nhóng qua hàng rào để dòm ngó nhà hàng xóm. </p> <p> Hai ông bà Dursley có một cậu quý tử tên là Dudley, mà theo ý họ thì không thể có đứa bé nào trên đời này ngoan hơn được nữa.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "3",
      "name": "Mê Đắm",
      "author": "Kim Họa",
      "image": "https://static.8cache.com/cover/eJzLyTDWD8o2Cyspda_MTwuxKPFNzjGuKDJ0LikKCTELy0538c4Ny3Uxr_QI8E7Oz3JJswwscCvMN3MJ8Cr09QuqKEpxL_EN9gwKTa0ydvFy9zcyKU7JTbctNzI01c0wNjICAERyH_0=/me-dam.jpg",
      "introduction": "<p>Cố Thanh Sương được mọi người ngợi khen là nữ thần trong giới showbiz, cô có vô số người hâm mộ, thường lọt vào hot search vì nhan sắc xinh đẹp của mình, trụ vững ở vị trí bình hoa lưu lượng hàng đầu trong giới giải trí.</p> <p> Vào nghề ba năm nay, bối cảnh bí ẩn, bên cạnh cũng không thiếu người theo đuổi, nhưng cô vẫn giữ mình, không để xảy ra tai tiếng, là thần tượng ‘tiêu chuẩn’ trong lòng người hâm mộ. </p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Nàng thở hồng hộc mà đỡ thang lầu lan can, ngừng một lát, tiếp tục bước nhanh hướng lên trên bò, một tầng lại một tầng, chuyển qua một cái lại một cái cong, rốt cuộc đến lầu sáu, hoãn khẩu khí, tay cầm ở then cửa thượng lại do dự, khẽ thở dài, vẫn là lấy ra chìa khóa mở cửa. </p>. <p> Không chút nào ngoài ý muốn, trên mặt đất một mảnh hỗn độn, quăng ngã toái bình rượu, xé bỏ nhạc phổ, còn có vốn nên ở trên bàn các loại tạp vật, hiện giờ đều bị chủ nhân quét tới rồi trên mặt đất.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "4",
      "name": "Dịu Dàng Tận Xương",
      "author": "Tây Phương Kinh Tế Học",
      "image": "https://static.8cache.com/cover/eJzLyTDWzw_I8CzxSy8Mq8pxTDLwiM-yyDQKN3AzrvRMzw13Li7yLzPOy_MwrfR2Ts30TwnN8oyIKk9MqspJsQy1yAz3dDV2yU_Nd0s0zQ_yjSwsLs62SLctNzI01c0wNjICAD_WIEo=/diu-dang-tan-xuong.jpg",
      "introduction": "<p>Khương Cách mang vẻ đẹp lạnh lùng, tính tình lãnh đạm, là mỹ nhân băng giá nổi tiếng trong giới giải trí.</p> <p>Năm ấy cô ra mắt bằng một bức ảnh chụp cùng với báo hoa mai. Trong khung cảnh cát bụi đầy trời, dưới một gốc cây khô, thiếu nữ khoác tấm lụa đỏ, đứng đối diện con báo hoa mai toàn thân phủ đốm. Ánh mắt cô lạnh lùng xa cách, ánh mắt con báo đề phòng nguy hiểm.</p> <p>Thời điểm chụp tấm ảnh ấy, Khương Cách vừa tròn mười tám tuổi. Năm ấy, cô gặp Quý Tranh. </p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Bên ngoài nhà vệ sinh, tiếng xì xào bàn tán của hai cô gái xa dần. Khương Cách vặn vòi nước, dòng nước lạnh lẽo chạm vào đầu ngón tay cô, bụng dưới lại quặn đau. </p>. <p> Trước đây Khương Cách chưa từng bị đau bụng khi đến kỳ như thế, nhưng mấy năm trước, sau một cảnh quay rơi xuống nước giữa mùa đông giá rét, việc này bắt đầu phát sinh. Mỗi lần đến kỳ, bụng dưới của cô như một bao cát bị người ta đấm đá, cơn đau âm ỉ khiến cô phải xin tạm dừng ba lần liên tiếp cả buổi trưa nay.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "5",
      "name": "Tiên Nghịch  ",
      "author": "Nhĩ Căn",
      "image": "https://static.8cache.com/cover/o/eJzLyTDT1w0sDgtMCjFO8XMO1A9zCvSLTK5wzDL01HeEguyAQH3v0IK8TK_i-IjCSP1yI0NT3QxjIyMAV4kSwQ==/tien-nghich.jpg",
      "introduction": "<p>Tiên Nghịch là câu chuyện Tiên Hiệp kể về Vương Lâm - một thiếu niên bình thường, may mắn được gia nhập vào một môn phái tu tiên xuống dốc của nước Triệu, vì thiếu linh căn, vì một hiểu nhầm tai hại, vì một khối thiết tinh và nhờ có được một \"Thần Bí Hạt Châu\" </p>. <p> Vương Lâm đã bước lên con đường tu tiên và trên con đường này, hắn sẽ đối mặt với chuyện gì? </p>",
      "chapters": [
        {
          "id": "1",
          "title": "Ly hương",
          "content": "<p>Thiết Trụ ngồi ở bên con đường nhỏ trong thôn, vẻ mặt ngẩn ngơ nhìn bầu trời xanh thẳm, Thiết Trụ vốn không phải là tên thật của hắn, mà là từ bé bởi vì thân thể gầy yếu, phụ thân sợ nuôi không được, vì thế dựa theo tập tục mà gọi tên mụ.</p>. <p> Hắn vốn tên là Vương Lâm, họ Vương ở trong vài cái thôn xóm xung quanh xem như danh gia, tổ tiên xuất thân thợ mộc, nhất là ở thị trấn, gia tộc họ Vương cũng coi như rất có danh tiếng, có được mấy cửa hiệu chuyên môn bán sản phẩm gỗ.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "6",
      "name": "Nguyên Tôn",
      "author": "Thiên Tằm Thổ Đậu",
      "image": "https://static.8cache.com/cover/eJzLyTDWdwk2zQrzCTEsr0z0CIoMCnIOsgw2DzYy1vVPL3WyyHfNyPf10nUNzw8v9grzjw-IcvaqqCryLYsPMzHJSKsMCi10NTUOjQwuqLDw1HXRrSxJSUq2LTcyNNXNMDYyAgD1Fx7t/nguyen-ton.jpg",
      "introduction": "<p>Dùng huyền hoàng khí bạn thân sở hữu, mọi thứ thiện địa nhật nguyệt tinh đều bị ta nuốt hết </p>",
      "chapters": [
        {
          "id": "1",
          "title": "Mãng tước nuốt rồng",
          "content": "<p>Bên trong nội điện đèn đuốc sáng trưng, xa hoa tráng lệ, khí thế uy nghiêm, bên trong điện có thắp trường minh đăng, bên trong đang đốt một viên đá xanh, khói xanh lượn lờ bay lên, vấn vít trong điện. </p>. <p> Đó chính là thanh đàn thạch, khi đốt cháy sẽ tỏa ra một hương thơm lạ lùng, có hiệu quả ngưng thần tĩnh khí, là vật cần chuẩn bị cho những lúc tu luyện, bất quá giá cả của thứ này cũng không rẻ, có thể dùng nó như một loại hương liệu thế này, đủ để nói rõ chủ nhân của nơi đây có địa vị không tầm thường.</p> ",
          "uploadedDate": ""
        },
        {
          "id": "2",
          "title": "Nguyên Văn",
          "content": "<p>Bên trong nội điện đã hoàn toàn yên tĩnh, không khí bị đè nén tới mức khiến cho người ta không thở nổi. </p>. <p> Chu Nguyên nhìn về phía Chu Kình đang ngồi bên cạnh, nửa bên mặt uy nghiêm của hắn lúc này lại lộ ra vẻ vô lực lẫn sa sút, rõ ràng, chuyện năm đó xảy ra với mình đã tạo thành đả kích cực kỳ lớn đối với hắn.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "7",
      "name": "Núi của nàng, biển của nàng",
      "author": "Phù Hoa.",
      "image": "https://static.8cache.com/cover/eJzLyTDWT_KMTPSKjNctzC4ozyp3Kk0Nj3AzcC8uddI18XALjMy2sPTO9PbNNXNKSqv0T60wdncK8HCsNEkJdAl1CjWJrygvCPJ0i_L0jQgoCQn0yrS0LTcyNNXNMDYyAgDKqB5D/nui-cua-nang-bien-cua-nang.jpg",
      "introduction": "<p> \"Hồ nước là hồ nước lặng, cá bơi nguyện ý vào hồ này chăng?\". </p> <p> \n \"Nguyện ý.\" </p>",
      "chapters": [
        {
          "id": "1",
          "title": "Trì Đường - Hồ nước",
          "content": "<p>đứa quái thai thích độc lai độc vãng, kẻ khác biệt bị kính nhi viễn chi. </p>. <p> Tỉnh dậy trong một căn phòng xa lạ, Trì Đường có chút phản ứng không kịp. Nàng cứ nằm đó không nhúc nhích trừng mắt nhìn trần nhà trong chốc lát, mới nhớ ra, đây là chỗ ở mới.</p> <p>Ngoài cửa sổ, hình như trời đang mưa, thành phố Nam Lâm này thích đổ mưa quá mức, mới tới nơi này một tuần ngắn ngủi mà gần như ngày nào cũng mưa. Trì Đường không thích trời mưa, mỗi khi mưa rơi, tâm tình của nàng liền rất không tốt.</p> ",
          "uploadedDate": ""
        },
        {
          "id": "2",
          "title": "Giấy viết thư",
          "content": "<p>Đổi chỗ ngồi lần một, Trì Đường ngồi trước một nam sinh, tên Vương Tiêu Dương. Cậu ta là học sinh rắc rối điển hình, đến trễ về sớm trốn học đánh nhau, xếp hạng thứ tư từ dưới đếm lên, lúc nào cũng bị thầy cô nhắc cắt tóc, nhưng cắt đi cắt lại cũng không thấy thay đổi gì.</p> <p>Lúc trước cậu ta ngồi cách Trì Đường một chỗ ngồi, thường xuyên đổi chỗ với người ta, cố ý tìm nàng nói chuyện, hiện tại ngồi ngay sau nàng, lại càng thường xuyên chọc nàng một chút. Cố ý dùng bút chọc lưng chọc vai nàng, lại gần tai nàng lớn tiếng nói chuyện, trêu cợt đùa giỡn với bạn bè thường cố ý va vào người nàng.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "8",
      "name": "Quỷ Thần Trong Tòa Nhà Cổ",
      "author": "Phù Hoa.",
      "image": "https://static.8cache.com/cover/eJzLyTDWrzANSIsvTMpxd88wdLQsD40qdnF38XcpCM6vcguJyvDKM6iKd4wyryxMrTSL96wsiHLzLbVIDfEsjnc2yjExzDfyzE_Jjy_MdjVIyrYsS8u1LTcyNNXNMDYyAgDu_B9V/quy-than-trong-toa-nha-coa.jpg",
      "introduction": "<p>\"Về sau tôi có thể cung phụng ngài không? Nếu ngài không chê thì tôi sẽ dâng hoa tươi, hương khói hoặc tế phẩm cho ngài.\n </p>",
      "chapters": [
        {
          "id": "1",
          "title": "Tòa nhà cổ",
          "content": "<p>Lúc bị kiểm sát viên bắt được rồi tống vào nhà tù khu Du Lâm, La Ngọc An cho rằng cô sẽ bị áp giải tới pháp trường để thẩm phán thi hành án nhanh thôi.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "9",
      "name": "Con Đường Giải Oan Của Nữ Pháp Y",
      "author": "Giản Khuyết",
      "image": "https://lh3.googleusercontent.com/pw/AJFCJaXXQ5Lpjlxp7OGAkCJabifmRIt94Mv2oJwZ_2SyD0iIaK3XhpxbBr462pHPWeKa0ClQUBhuiMX0ZVOKkO2kqYFyUd48PTHhxBx3Ac8VEsMDKXO6Yg1A_1FA1kKRYrNjZRCCTd52Z53LTn9Lkgi-U7Xv=w215-h322-s-no?authuser=3",
      "introduction": "<p>Sở Ngôn bò ra từ trong biển lửa địa ngục, trên lưng mang tội danh bán đứng chiến hữu.</p> <p> Toàn thân nàng bị bỏng một khoảng lớn, vẻ đẹp từng có không còn tồn tại nữa. </p>",
      "chapters": [
        {
          "id": "1",
          "title": "Trống Rỗng",
          "content": "<p>Ầm ầm ——!! </p> <p>Làn khói nóng như thiêu đốt phun ra từ nóc tòa nhà cao chọc trời, chỉ trong chốc lát ánh lửa đã cuồn cuộn kéo đến, tàn sát bừa bãi, bảng hiệu lớn trên mái nhà lóe lên ánh sáng rồi ầm ầm rơi xuống.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "10",
      "name": "Lớp Học Biết Tuốt",
      "author": "Kinugasa Shougo",
      "image": "https://i.pinimg.com/564x/92/79/2a/92792a75c7cf312b69c72dcc76b85885.jpg",
      "introduction": "<p>Trường Cao trung Koudo Ikusei, một ngôi trường uy tín hàng đầu với cơ sở vật chất hiện đại, nơi có gần 100% học sinh ra trường đều học đại học hoặc kiếm được việc làm. Học sinh nơi đây đều được tự do cắt mọi kiểu đầu và mang mọi đồ dùng cá nhân họ muốn. Koudo Ikusei là một trường học thiên đường, nhưng sự thật là chỉ những học sinh đứng đầu mới nhận được sự đối đãi đặc ân này.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "Chào mừng đến với cuộc sống học đường trong mơ của tôi",
          "content": "<p>“Ayanokouji-kun, cậu ổn chứ?”</p> <p>Nó lại đến. Nó lại đến. Cái tình huống đáng sợ.</p> <p>Khi tôi đang giả vờ ngủ, có một người đến.</p> <p>Đó là sự hiện thân của ác quỷ, ép tôi (đang chợp mắt một lát) phải thức tỉnh trở về thực tại.</p> ",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "11",
      "name": "Harry potter và Phòng chứa bí mật (Quyển 2)",
      "author": "J. K. Rowling",
      "image": "https://cdn0.fahasa.com/media/catalog/product/9/7/9781408855669-1.jpg?_gl=1*axemiz*_ga*MTMyOTIzMjUyOS4xNjk4NjQxMzc4*_ga_460L9JMC2G*MTY5ODY0MTM3Ny4xLjAuMTY5ODY0MTM3Ny42MC4wLjA.*_gcl_au*MTQwNzIzNzE1MS4xNjk4NjQxMzc4",
      "introduction": "<p>Một con gia tinh cảnh báo Harry không nên quay lại Hogwarts, nhưng cậu quyết định phớt lờ. Khi học sinh và sinh vật trong trường bắt đầu hóa đá, Harry thấy mình bị bao vây trong sự bí ẩn.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "Sinh Nhật Buồn Nhất",
          "content": "<p>Đây không phải là vụ cãi vã đầu tiên nổ ra trong buổi điểm tâm ở nhà số 4 đường Privet Drive. Hồi sáng sớm tinh sương này, ông Vernon Dursley đã bị đánh thức vì một tiếng cú rúc inh tai phát ra từ căn phòng thằng cháu Harry của ông.</p> <p>Ông gầm lên từ phía đầu bàn ăn:</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "12",
      "name": "Ta Muốn Trở Thành Chúa Tể Bống Tối",
      "author": "Akasatana",
      "image": "https://i.docln.net/lightnovel/covers/s3569-4f9d3270-6d42-4301-8ad7-761e917fc3b6-m.jpg",
      "introduction": "<p>Như bao người ngưỡng mộ những anh hùng khi còn nhỏ, nhân vật chính của chúng ta lại ngưỡng mộ những con người trong bóng tối. Sau khi giấu đi khả năng thật sự và sống 1 cuộc đời tầm thường của 1 thường dân vào ban ngày trong khi trải qua những khóa huấn luyện điên rồ vào ban đêm, anh ta cuối cùng cũng được chuyển sinh sang thê giới khác. Người đàn ông ấy, người mà chỉ phô diễn sức mạnh trong bóng tối,những người hầu cận, và cùng với đó là tổ chức lớn mạnh của anh…</p>",
      "chapters": [
        {
          "id": "1",
          "title": "Cô gái mơ một giấc mộng và chàng trai người dẫn lối giấc mơ ấy",
          "content": "<p>Rose đang lê bước trong đường hầm tăm tối.</p><p>Vết thương trên lưng nhận phải do chạy trốn vẫn đang rỉ máu. Mặc dù không sâu, nó chắc chắn không hề nông.</p><p>Cô cần được điều trị ngay lập tức, nhưng do đang bị truy sát, do đó, không có thời gian hay cơ hội cho việc đấy. Tập trung ma thuật vào vết thương như một giải pháp tạm thời, nhưng cơn đau chỉ gia tăng theo thời gian.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "13",
      "name": "Harry Potter và Tên tù nhân ngục Azkaban (Quyển 3)",
      "author": "J. K. Rowling",
      "image": "https://bizweb.dktcdn.net/100/326/228/products/harry-potter-and-the-prisoner-of-azkaban-by-j-k-rowling-jpeg.jpg",
      "introduction": "<p>Năm thứ ba của Harry Potter tại Hogwarts hóa ra lại đầy sự kiện khi cậu được giáo sư Lupin, giáo viên Phòng chống Nghệ thuật Hắc ám dạy kèm và đối đầu với Sirius Black, một tù nhân chạy trốn đầy thù hận.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Harry Potter là một thằng bé không bình thường về nhiều phương diện. Một trong những điểm không bình thường đó là nó rất ghét mùa hè, ghét hơn bất cứ quãng thời gian nào khác trong năm. Một điều bất thường khác nữa là nó rất muốn làm bài tập, nhưng lại phải làm bài trong bí mật, vào giữa đêm hôm khuya khoắt. Và cuối cùng, chỉ vì ngẫu nhiên mà nó trở thành phù thủy.</p> <p>Lúc này đã gần nửa đêm. Harry đang nằm sấp trên giường, tấm chăn trùm phía trên đầu như một cái lều con, tay cầm đèn pin, một quyển sách bìa da bự (Một Trang sử Pháp thuật, của Adabert Waffling) để mở, tựa trên cái gối. Harry dùng đầu nhọn của cây viết lông đại bàng dò lần đến cuối trang sách, cau mày tìm kiếm cái gì đó khả dĩ giúp nó viết được bài luận văn được ra đề là \"Hãy bình luận ý kiến sau: Thiêu sống phù thuỷ ở thế kỷ mười bốn là chuyện hoàn toàn vô nghĩa.\"</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "14",
      "name": "Harry Potter và Chiếc cốc lửa (Quyển 4)",
      "author": "J. K. Rowling",
      "image": "https://static.wikia.nocookie.net/harrypotter/images/a/a3/Goblet_of_Fire_New_Cover.jpg",
      "introduction": "<p>Vào năm thứ tư tại Hogwarts, Harry phải miễn cưỡng tham gia một giải đấu phù thủy cổ đại sau khi ai đó chọn tên cậu một cách bí ẩn, trong khi Chúa tể Hắc ám đang bí mật âm mưu điều gì đó nham hiểm.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Dân làng Hangleton Nhỏ vẫn còn gọi đó là “Ngôi Nhà Riddle “, mặc dù đã bao năm tháng trôi qua kể từ thời gia đình Riddle còn sống ở đó. Ngôi nhà nằm trên một đỉnh đồi ngó xuống làng, một số cửa sổ đã bị bít lại bằng ván, ngói lợp mái thủng lỗ chỗ, và dây trường xuân tự do mọc tràn lan khắp mặt tiền nhà. Có một thời ngôi nhà đó từng là một biệt thự xinh xắn, đứng cách đó cả dặm vẫn nhìn thấy rõ. Đó cũng từng là ngôi nhà rộng lớn nhứt, sang trọng nhứt, nhưng giờ đây Ngôi Nhà Riddle chỉ còn là một nơi điêu tàn, ẩm mục,vô chủ, không người vãng lai.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "15",
      "name": "Harry Potter và Hội Phượng Hoàng (Quyển 5)",
      "author": "J. K. Rowling",
      "image": "https://upload.wikimedia.org/wikipedia/en/7/70/Harry_Potter_and_the_Order_of_the_Phoenix.jpg",
      "introduction": "<p>Lời cảnh báo của Harry Potter và cụ Dumbledore về sự trở lại của Chúa tể Voldemort không được chính quyền phù thủy chú ý, những người lần lượt tìm cách làm suy yếu quyền lực của cụ Dumbledore tại Hogwarts và làm mất uy tín của Harry.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Ngày nắng nhất của mùa hè cho đến lúc này đã chấm dứt và nó thấm một sự tĩnh lặng uể oải vào những ngôi nhà vuông và to ở đường Privet Drive. Những chiếc xe thường xuyên bám một lớp bụi mờ đậu ở đường lái vào nhà và những bãi cỏ màu xanh trở thành màu vàng - những ống nước tưới đã bị cấm sử dụng vì đợt khô hạn làm thiếu nước. Việc tước đi cái mưu cầu thường xuyên là rửa xe và tưới cho cỏ, những người dân cư ngụ ở đường Privet Drive đã sống ẩn dật trong những cái bóng của những căn nhà mát, cửa sổ đuợc mở tung ra để ảo vọng về những cơn gió hiu hiu sẽ thổi tới. Chỉ còn một cậu bé thiếu niên phải ở ngoài nhà và cậu đang nằm ngửa trên một thảm hoa phía ngoài căn nhà số bốn. Cậu ta có làn da rám nắng, tóc đen, đeo kính cận; đó là một người bất hạnh, hơi ốm yếu mà người ta nhìn thoáng qua cũng thấy. Quần áo bò của cậu thấm đẫm nước mắt và rất bẩn, cái áo thể thao rộng lùng thùng thì đã mờ màu, và đôi giày dành cho huấn luyện viên thì đã há mõm. Sự xuất hiện của Harry Potter không làm cho cậu chiếm được cảm tình của hàng xóm - những người mà một số trong bọn họ nghĩ rằng sự bẩn thỉu nên bị trừng trị theo pháp luật, mặc dù chính cậu đã tự giấu mình vào sau một bụi cây tú cầu to để hầu như chẳng người láng giềng nào nhìn thấy. Thực sự thì, trường hợp duy nhất để cậu ta bị ai đó nhìn thấy là nếu dượng Vernon hoặc dì Petunia thò đầu ra ngoài cửa sổ và nhìn xuống phía dưới thảm cỏ. Nhưng trên hết, Harry nghĩ rằng cậu đáng được tuyên dương vì đã nghĩ ra ý tưởng trốn vào đây. Cậu đã không cảm thấy dễ chịu khi nằm trên cái nóng và rắn của đất - có thể như vậy - nhưng đổi lại không có ai nhìn trừng trừng giận dữ vào cậu, nghiến răng kèn kẹt đến nỗi không thể nghe được tin tức, hoặc ném thẳng những câu hỏi dơ dáy vào cậu - việc đã xảy ra khi cậu thử ngồi vào phòng khách và xem tivi với dượng và dì. Cứ như thể là những cái suy nghĩ này đã đi qua cửa sổ mở, ông Vernon Dursley, dượng của Harry, thình lình nói:\"Thật vui mừng khi thấy thằng nhãi thôi húc đầu vào cửa. Nó đang ở đâu vậy?\"</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "16",
      "name": "Harry Potter và Hoàng tử lai (Quyển 6)",
      "author": "J. K. Rowling",
      "image": "https://static.wikia.nocookie.net/harrypotter/images/9/95/Half-Blood_Prince_new_cover.jpg",
      "introduction": "<p>Cụ Dumbledore và Harry Potter tìm hiểu thêm về quá khứ của Voldemort và sự trỗi dậy quyền lực của hắn. Trong khi đó, Harry tình cờ tìm thấy một cuốn sách giáo khoa độc dược cũ của một người tự xưng là Hoàng tử lai.</p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Một vị Bộ trưởng của Thế giới khác</p><p>Đã gần nửa đêm, và Thủ tướng đang ở một mình trong phòng, đọc một bản thông cáo dài. Chúng trượt qua óc ông, không để lại một chút ý nghĩa nào, dù là nhỏ nhất. Ông đang chờ cú điện thoại của Tổng thống một đất nước xa xôi. Vừa tự hỏi bao giờ tên khỉ gió đó mới gọi điện, vừa cố dập tắt những kí ức không dễ chịu về một tuần làm việc dài, mệt mỏi, đầy khó khăn, trong đầu của ông không còn chỗ cho những việc khác. Càng cố tập trung vào tờ giấy trước mặt, khuôn mặt hả hê của những đối thủ chính trị càng hiện ra rõ hơn truước mặt Thủ tướng. Có một đối thủ đã xuất hiện đi xuất hiện lại trên mặt báo, hắn không chỉ kể lể những lỗi lầm của Chính phủ (dù chẳng ai cần nhắc lại cả) mà còn chỉ ra nguyên nhân từng cái một và đổ lỗi lên chính phủ.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "17",
      "name": "Harry Potter và Bảo bối Tử thần (Quyển 7)",
      "author": "J. K. Rowling",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1663805647i/136251.jpg",
      "introduction": "<p>Harry phải gánh một nhiệm vụ đen tối, nguy hiểm và dường như bất khả thi: đó là xác định vị trí và tiêu diệt các Trường sinh linh giá còn lại của Voldemort. Chưa bao giờ Harry cảm thấy cô đơn đến thế, hay phải đối mặt với một tương lai đầy bóng tối đến thế. Nhưng Harry bằng cách nào đó phải tìm thấy trong mình sức mạnh để hoàn thành nhiệm vụ được giao. Anh ta phải rời bỏ sự ấm áp, an toàn và đồng hành của Hang Sóc và đi theo con đường không thể lay chuyển đã bày ra cho anh ta mà không sợ hãi hay do dự...</p>",
      "chapters": [
        {
          "id": "1",
          "title": "",
          "content": "<p>Chúa tể Hắc ám đang lên</p><p>Hai người đàn ông hiện ra từ cõi không, cách nhau vài thước, trên một con đường nhỏ hẹp dưới ánh trăng. Cả hai cùng đứng im phắc trong một giây, đũa phép của người này chĩa vào ngực người kia. Nhưng khi nhận ra nhau họ thu đũa cất vào áo choàng, bắt đầu đi về cùng một hướng.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    }
  ],
  "genres": [
    {
      "id": "1",
      "name": "Bách Hợp",
      "introduction": "Truyện tình cảm giữa nữ và nữ."
    },
    {
      "id": "2",
      "name": "Cổ Đại",
      "introduction": "Truyện có nội dung xảy ra ở thời cổ đại phong kiến."
    },
    {
      "id": "3",
      "name": "Siêu Nhiên",
      "introduction": "Truyện thường có những nhân vật sở hữu các năng lực siêu nhiên đặc biệt mà người thường không thể nào có được."
    },
    {
      "id": "4",
      "name": "Hành Động",
      "introduction": "Thể loại này thường có nội dung về đánh nhau, bạo lực, hỗn loạn, với diễn biến nhanh"
    },
    {
      "id": "5",
      "name": "Đam Mỹ",
      "introduction": "Truyện tình cảm giữa nam và nam."
    },
    {
      "id": "6",
      "name": "Hiện Đại",
      "introduction": "Những truyện có nội dung chủ yếu diễn ra trong môi trường đô thị hiện đại."
    },
    {
      "id": "7",
      "name": "Đời Thường",
      "introduction": "Truyện điền văn kể về cuộc sống điền viên, chăm sóc nhà cửa, lo toan cuộc sống sự nghiệp cũng như đời sống tình cảm của nhân vật chính. Truyện thể loại này thường ngọt ngào, không có cao trào, nút thắt, tranh đấu, tuy nhiên vẫn có một số ngoại lệ."
    },
    {
      "id": "8",
      "name": "Đoản Văn",
      "introduction": "Truyện đoản văn là những truyện có nội dung ngắn, thưởng chỉ có một đến vài chương."
    },
    {
      "id": "9",
      "name": "Huyền Bí",
      "introduction": "Truyện có những yếu tố huyền bí, khoa học khó giải thích và những nỗ lực của nhân vật chính nhằm tìm ra sự thật."
    },
    {
      "id": "10",
      "name": "Hài Hước",
      "introduction": "Những bộ truyện có nội dung hài hước, đem lại tiếng cười vui vẻ cho độc giả."
    },
    {
      "id": "11",
      "name": "Kiếm Hiệp",
      "introduction": "Truyện thường xoay quanh cuộc đời của nhân vật chính, quá trình rèn luyện, trưởng thành, tìm kiếm, học tập các bí kíp võ công, cùng những cuộc phiêu lưu, truy đuổi, chém giết... đầy nguy hiểm và cơ hội trong giới võ lâm giang hồ."
    },
    {
      "id": "12",
      "name": "Kinh Dị",
      "introduction": "Truyện có nhiều yếu tố ma quỷ, rùng rợn, kinh dị."
    },
    {
      "id": "13",
      "name": "Khoa Huyễn",
      "introduction": "Bao gồm những chuyện Khoa Học - Viễn Tưởng, đa phần chúng xoay quanh nhiều hiện tượng mà liên quan tới khoa học, công nghệ, tuy vậy thường thì những câu chuyện đó không gắn bó chặt chẽ với các thành tựu khoa học hiện thời, mà là do con người tưởng tượng ra"
    },
    {
      "id": "14",
      "name": "Lịch Sử",
      "introduction": "Nội dung truyện thường xảy ra trong lịch sử, có nhiều yếu tố tương tự so với lịch sử thế giới thật."
    },
    {
      "id": "15",
      "name": "Light Novel",
      "introduction": "Light Novel là một dạng tiểu thuyết Nhật Bản được viết nhằm chủ yếu hướng đến các độc giả trẻ như học sinh trung học. Dạng tiểu thuyết đang lan rộng và được giới tác giả cũng như độc giả trên thế giới đón nhận nồng nhiệt."
    },
    {
      "id": "16",
      "name": "Ngôn Tình",
      "introduction": "Truyện thuộc kiểu lãng mạn, kể về những sự kiện vui buồn trong tình yêu của nhân vật chính."
    },
    {
      "id": "17",
      "name": "Quân Sự",
      "introduction": "Truyện có yếu tố quân sự, thường diễn ra trong môi trường quân đội, quân lính."
    },
    {
      "id": "18",
      "name": "Thám Hiểm",
      "introduction": "Nội dung truyện thường là những cuộc phiêu lưu thám hiểm những địa danh kỳ bí cực gay cấn."
    },
    {
      "id": "19",
      "name": "Trinh Thám",
      "introduction": "Truyện trinh thám là thể loại truyện mang yếu tố điều tra, phá án mang nhiều yếu tố hình sự, với sự kích tính đến nghẹt thở từ những vụ án mạng ly kỳ hấp dẫn."
    },
    {
      "id": "20",
      "name": "Xuyên Không",
      "introduction": "Đây là thể truyện có nhân vật chính vì một lý do nào đó mà được sống lại sau khi chết đi, thể loại này thường kết hợp với thể loại xuyên không."
    },
    {
      "id": "21",
      "name": "Bi Kịch",
      "introduction": "Thể loại mang đến cho người xem những cảm xúc khác nhau: buồn bã, căng thẳng thậm chí là bi phẫn"
    },
    {
      "id": "22",
      "name": "Thể Thao",
      "introduction": "Đúng như tên gọi, những môn thể thao như bóng đá, bóng chày, bóng chuyền, đua xe, cầu lông,... là một phần của thể loại này"
    },
    {
      "id": "23",
      "name": "Tâm Lý",
      "introduction": "Truyện đi sau vào khắc họa những vấn đề về tâm lý của nhân vật"
    },
    {
      "id": "24",
      "name": "Học Đường",
      "introduction": "Ngữ cảnh diễn biến câu chuyện chủ yếu ở trường học, diễn biến chính xoay quanh học sinh, sinh viên hoặc giáo viên, giảng viên"
    }
  ],
  "novelGenre": [
    {
      "novelId": "1",
      "genreId": "3"
    },
    {
      "novelId": "1",
      "genreId": "4"
    },
    {
      "novelId": "2",
      "genreId": "4"
    },
    {
      "novelId": "2",
      "genreId": "9"
    },
    {
      "novelId": "2",
      "genreId": "24"
    },
    {
      "novelId": "3",
      "genreId": "16"
    },
    {
      "novelId": "3",
      "genreId": "6"
    },
    {
      "novelId": "4",
      "genreId": "16"
    },
    {
      "novelId": "5",
      "genreId": "4"
    },
    {
      "novelId": "5",
      "genreId": "11"
    },
    {
      "novelId": "5",
      "genreId": "18"
    },
    {
      "novelId": "6",
      "genreId": "11"
    },
    {
      "novelId": "6",
      "genreId": "18"
    },
    {
      "novelId": "7",
      "genreId": "1"
    },
    {
      "novelId": "7",
      "genreId": "24"
    },
    {
      "novelId": "8",
      "genreId": "9"
    },
    {
      "novelId": "8",
      "genreId": "12"
    },
    {
      "novelId": "8",
      "genreId": "14"
    },
    {
      "novelId": "9",
      "genreId": "1"
    },
    {
      "novelId": "9",
      "genreId": "19"
    },
    {
      "novelId": "10",
      "genreId": "15"
    },
    {
      "novelId": "10",
      "genreId": "23"
    },
    {
      "novelId": "10",
      "genreId": "24"
    },
    {
      "novelId": "10",
      "genreId": "24"
    },
    {
      "novelId": "11",
      "genreId": "4"
    },
    {
      "novelId": "11",
      "genreId": "9"
    },
    {
      "novelId": "11",
      "genreId": "24"
    },
    {
      "novelId": "12",
      "genreId": "3"
    },
    {
      "novelId": "12",
      "genreId": "4"
    },
    {
      "novelId": "12",
      "genreId": "10"
    },
    {
      "novelId": "12",
      "genreId": "20"
    },
    {
      "novelId": "12",
      "genreId": "15"
    },
    {
      "novelId": "13",
      "genreId": "4"
    },
    {
      "novelId": "13",
      "genreId": "9"
    },
    {
      "novelId": "13",
      "genreId": "24"
    },
    {
      "novelId": "14",
      "genreId": "4"
    },
    {
      "novelId": "14",
      "genreId": "9"
    },
    {
      "novelId": "14",
      "genreId": "24"
    },
    {
      "novelId": "15",
      "genreId": "4"
    },
    {
      "novelId": "15",
      "genreId": "9"
    },
    {
      "novelId": "15",
      "genreId": "24"
    },
    {
      "novelId": "16",
      "genreId": "4"
    },
    {
      "novelId": "16",
      "genreId": "9"
    },
    {
      "novelId": "16",
      "genreId": "24"
    },
    {
      "novelId": "17",
      "genreId": "4"
    },
    {
      "novelId": "17",
      "genreId": "9"
    },
    {
      "novelId": "17",
      "genreId": "24"
    }
  ]
}