{
  "roles": [
    {
      "id": "1",
      "role": "Admin"
    },
    {
      "id": "2",
      "role": "Editor"
    },
    {
      "id": "3",
      "role": "Member"
    }
  ],
  "accounts": [
    {
      "id": "1",
      "roleId": "1",
      "username": "admin",
      "password": "admin",
      "isActived": true
    },
    {
      "id": "2",
      "roleId": "2",
      "username": "editor",
      "password": "editor",
      "isActived": true
    },
    {
      "id": "3",
      "roleId": "3",
      "username": "member",
      "password": "member",
      "isActived": true
    }
  ],
  "novels": [
    {
      "id": "1",
      "name": "Toàn Trí Độc Giả",
      "author": "Manhwa TV",
      "image": "https://truyenchu.vn/uploads/Images/toan-tri-doc-gia.jpg",
      "introduction": "Chỉ mình tôi mới biết kết cục của thế giới này. Một ngày nọ, nhân vật chính của chúng ta bị kẹt trong thế giới của bộ tiểu thuyết mình ưa thích. Anh phải làm gì để sống sót? Trong một thế giới tràn ngập những tai họa và nguy hiểm. Ưu thế ư? Anh nắm rõ kịch bản của toàn bộ câu truyện, ngay từ đầu đến cuối. Vì anh là độc giả duy nhất vẫn còn gắn bó với nó. Hãy đọc câu truyện của anh ấy để hiểu được cách mà anh ta sống sót trong thế giới này.",
      "chapters": [
        {
          "id": "1",
          "title": "Mở đầu - Ba Cách để Sống sót trong một Thế giới Đổ nát.",
          "content": "<p>[Có ba cách để sống sót trong một cái thế giới đổ nát </p>. <p> Hiện tại, tôi đã quên một vài cái, nhưng có một điều tôi có thể chắc chắn rằng, Bạn - người đang đọc những dòng này sẽ sống sót. </p> <p>- Ba cách để sống sót trong một thế giới đổ nát] Một trang web tiểu thuyết hiện lên trên màn hình điện thoại cũ nát của tôi. Tôi kéo lên rồi lại kéo xuống. Tôi làm chuyện này đã bao nhiêu lần rồi nhỉ? </p> <p>\" Thật sự? Đã kết thúc? \"</p> ",
          "uploadedDate": ""
        },
        {
          "id": "2",
          "title": "Mở đầu - Ba Cách để Sống sót trong một Thế giới Đổ nát.",
          "content": "",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    },
    {
      "id": "2",
      "name": "Harry Potter và Hòn đá Phù thủy (Quyển 1)",
      "author": "J. K. Rowling",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQtFKRzqIPBTYkse7NKIPTjw0ggQB02c636StmC1mONyQwec4x1",
      "introduction": "Harry Potter và Hòn đá Phù thủy là cuốn sách đầu tiên trong bộ truyện Harry Potter gồm bảy phần của tác giả người Anh J.K. Rowling. Được xuất bản vào ngày 30 tháng 6 năm 1997 bởi Nhà xuất bản Bloomsbury, cuốn sách này đặt nền tảng cho sáu cuốn sách sau. Nó giới thiệu với độc giả về thế giới phép thuật của Harry Potter và các nhân vật chính, địa điểm và thuật ngữ, đồng thời đặt ra những câu hỏi chưa được trả lời cho đến những cuốn sách tiếp theo. Điều này tạo nên cảm giác tò mò, tò mò cho người đọc.",
      "chapters": [
        {
          "id": "1",
          "title": "ĐỨA BÉ VẪN SỐNG",
          "content": "<p>Ông bà Dursley, nhà số 4 đường Privet Drive, tự hào mà nói họ hoàn toàn bình thường, cám ơn bà con quan tâm. Bà con đừng trông mong gì họ tin vào những chuyện kỳ lạ hay bí ẩn, đơn giản là vì họ chẳng hơi đâu bận tâm đến mấy trò vớ vẩn đó.</p> <p> Ông Dursley là giám đốc một công ty gọi là Grunnings, chuyên sản suất máy khoan. Ông là một người cao lớn lực lưỡng, cổ gần như không có, nhưng lại có một bộ ria mép vĩ đại.</p> <p> Bà Dursley thì ốm nhom, tóc vàng, với một cái cổ dài gấp đôi bình thường, rất tiện cho bà nhóng qua hàng rào để dòm ngó nhà hàng xóm. </p> <p> Hai ông bà Dursley có một cậu quý tử tên là Dudley, mà theo ý họ thì không thể có đứa bé nào trên đời này ngoan hơn được nữa.</p>",
          "uploadedDate": ""
        }
      ],
      "isFinished": false,
      "editorID": "2"
    }
  ],
  "genres": [
    {
      "id": "1",
      "name": "Bách Hợp",
      "introduction": "Truyện tình cảm giữa nữ và nữ."
    },
    {
      "id": "2",
      "name": "Cổ Đại",
      "introduction": "Truyện có nội dung xảy ra ở thời cổ đại phong kiến."
    },
    {
      "id": "3",
      "name": "Siêu Nhiên",
      "introduction": "Truyện thường có những nhân vật sở hữu các năng lực siêu nhiên đặc biệt mà người thường không thể nào có được."
    },
    {
      "id": "4",
      "name": "Hành Động",
      "introduction": "Thể loại này thường có nội dung về đánh nhau, bạo lực, hỗn loạn, với diễn biến nhanh"
    },
    {
      "id": "5",
      "name": "Đam Mỹ",
      "introduction": "Truyện tình cảm giữa nam và nam."
    },
    {
      "id": "6",
      "name": "Hiện Đại",
      "introduction": "Những truyện có nội dung chủ yếu diễn ra trong môi trường đô thị hiện đại."
    },
    {
      "id": "7",
      "name": "Đời Thường",
      "introduction": "Truyện điền văn kể về cuộc sống điền viên, chăm sóc nhà cửa, lo toan cuộc sống sự nghiệp cũng như đời sống tình cảm của nhân vật chính. Truyện thể loại này thường ngọt ngào, không có cao trào, nút thắt, tranh đấu, tuy nhiên vẫn có một số ngoại lệ."
    },
    {
      "id": "8",
      "name": "Đoản Văn",
      "introduction": "Truyện đoản văn là những truyện có nội dung ngắn, thưởng chỉ có một đến vài chương."
    },
    {
      "id": "9",
      "name": "Huyền Bí",
      "introduction": "Truyện có những yếu tố huyền bí, khoa học khó giải thích và những nỗ lực của nhân vật chính nhằm tìm ra sự thật."
    },
    {
      "id": "10",
      "name": "Hài Hước",
      "introduction": "Những bộ truyện có nội dung hài hước, đem lại tiếng cười vui vẻ cho độc giả."
    },
    {
      "id": "11",
      "name": "Kiếm Hiệp",
      "introduction": "Truyện thường xoay quanh cuộc đời của nhân vật chính, quá trình rèn luyện, trưởng thành, tìm kiếm, học tập các bí kíp võ công, cùng những cuộc phiêu lưu, truy đuổi, chém giết... đầy nguy hiểm và cơ hội trong giới võ lâm giang hồ."
    },
    {
      "id": "12",
      "name": "Kinh Dị",
      "introduction": "Truyện có nhiều yếu tố ma quỷ, rùng rợn, kinh dị."
    },
    {
      "id": "13",
      "name": "Khoa Huyễn",
      "introduction": "Bao gồm những chuyện Khoa Học - Viễn Tưởng, đa phần chúng xoay quanh nhiều hiện tượng mà liên quan tới khoa học, công nghệ, tuy vậy thường thì những câu chuyện đó không gắn bó chặt chẽ với các thành tựu khoa học hiện thời, mà là do con người tưởng tượng ra"
    },
    {
      "id": "14",
      "name": "Lịch Sử",
      "introduction": "Nội dung truyện thường xảy ra trong lịch sử, có nhiều yếu tố tương tự so với lịch sử thế giới thật."
    },
    {
      "id": "15",
      "name": "Light Novel",
      "introduction": "Light Novel là một dạng tiểu thuyết Nhật Bản được viết nhằm chủ yếu hướng đến các độc giả trẻ như học sinh trung học. Dạng tiểu thuyết đang lan rộng và được giới tác giả cũng như độc giả trên thế giới đón nhận nồng nhiệt."
    },
    {
      "id": "16",
      "name": "Ngôn Tình",
      "introduction": "Truyện thuộc kiểu lãng mạn, kể về những sự kiện vui buồn trong tình yêu của nhân vật chính."
    },
    {
      "id": "17",
      "name": "Quân Sự",
      "introduction": "Truyện có yếu tố quân sự, thường diễn ra trong môi trường quân đội, quân lính."
    },
    {
      "id": "18",
      "name": "Thám Hiểm",
      "introduction": "Nội dung truyện thường là những cuộc phiêu lưu thám hiểm những địa danh kỳ bí cực gay cấn."
    },
    {
      "id": "19",
      "name": "Trinh Thám",
      "introduction": "Truyện trinh thám là thể loại truyện mang yếu tố điều tra, phá án mang nhiều yếu tố hình sự, với sự kích tính đến nghẹt thở từ những vụ án mạng ly kỳ hấp dẫn."
    },
    {
      "id": "20",
      "name": "Xuyên Không",
      "introduction": "Đây là thể truyện có nhân vật chính vì một lý do nào đó mà được sống lại sau khi chết đi, thể loại này thường kết hợp với thể loại xuyên không."
    },
    {
      "id": "21",
      "name": "Bi Kịch",
      "introduction": "Thể loại mang đến cho người xem những cảm xúc khác nhau: buồn bã, căng thẳng thậm chí là bi phẫn"
    },
    {
      "id": "22",
      "name": "Thể Thao",
      "introduction": "Đúng như tên gọi, những môn thể thao như bóng đá, bóng chày, bóng chuyền, đua xe, cầu lông,... là một phần của thể loại này"
    },
    {
      "id": "23",
      "name": "Tâm Lý",
      "introduction": "Truyện đi sau vào khắc họa những vấn đề về tâm lý của nhân vật"
    },
    {
      "id": "24",
      "name": "Học Đường",
      "introduction": "Ngữ cảnh diễn biến câu chuyện chủ yếu ở trường học, diễn biến chính xoay quanh học sinh, sinh viên hoặc giáo viên, giảng viên"
    }
  ],
  "novelGenre": [
    {
      "novelId": "1",
      "genreId": "3"
    },
    {
      "novelId": "1",
      "genreId": "4"
    },
    {
      "novelId": "2",
      "genreId": "4"
    },
    {
      "novelId": "2",
      "genreId": "9"
    },
    {
      "novelId": "2",
      "genreId": "24"
    }
  ]
}